alexandergrib/ESP32_temp_and_Humidity_monitor/satellite/satellite.ino
uint32_t normalizeReportInterval(uint32_t ms) {
    return max(ms, MIN_REPORT_MS);
}

uint16_t normalizeSampleRateHz(uint32_t hz) {
    return static_cast<uint16_t>(constrain(hz, MIN_SAMPLE_RATE_HZ, MAX_SAMPLE_RATE_HZ));
}

uint32_t requestedSamplePeriodUs() {
    return max<uint32_t>(1000000UL / normalizeSampleRateHz(sampleRateHz), SENSOR_MIN_SAMPLE_PERIOD_US);
}

uint32_t samplePeriodUs() {
    return constrain(
        max(sensorSampler.effectiveSamplePeriodUs, requestedSamplePeriodUs()),
        requestedSamplePeriodUs(),
        SENSOR_MAX_SAMPLE_PERIOD_US
    );
}

bool isValidSensorSample(float temperatureC, float humidityPct) {
    return isfinite(temperatureC) &&
           isfinite(humidityPct) &&
           temperatureC >= SENSOR_MIN_VALID_TEMP_C &&
           temperatureC <= SENSOR_MAX_VALID_TEMP_C &&
           humidityPct >= SENSOR_MIN_VALID_HUMIDITY_PCT &&
           humidityPct <= SENSOR_MAX_VALID_HUMIDITY_PCT;
}

bool hasRecentGoodSample(uint32_t nowUs) {
    return lastGoodSampleAtUs != 0 &&
           timeReachedUs(nowUs, lastGoodSampleAtUs) &&
           (nowUs - lastGoodSampleAtUs) <= SENSOR_LAST_GOOD_MAX_AGE_US &&
           isValidSensorSample(lastTempC, lastHumidity);
}

bool canReuseLastSampleForChunk(uint32_t nowUs) {
    return hasRecentGoodSample(nowUs) &&
           (nowUs - lastGoodSampleAtUs) <= max(SENSOR_EMPTY_CHUNK_FILL_MAX_AGE_US, samplePeriodUs() * 2U);
}

uint32_t averagingWindowMs() {
    const uint32_t reportMs = normalizeReportInterval(reportIntervalMs);
    const uint32_t scaledWindowMs = max<uint32_t>(
        SENSOR_MIN_AVERAGING_WINDOW_MS,
        (reportMs * SENSOR_AVERAGING_WINDOW_PERCENT) / 100U
    );
    return min<uint32_t>(scaledWindowMs, SENSOR_MAX_AVERAGING_WINDOW_MS);
}

uint32_t averagingWindowUs() {
    return averagingWindowMs() * 1000UL;
}

void clearBufferedChunks() {
    rollingChunkHead = 0;
    rollingChunkCount = 0;
}

void trimRollingChunks(uint32_t nowUs) {
    const uint32_t windowUs = averagingWindowUs();
    while (rollingChunkCount > 0) {
        const RollingChunk& chunk = rollingChunks[rollingChunkHead];
        if (!timeReachedUs(nowUs, chunk.endedAtUs)) {
            break;
        }
        if ((nowUs - chunk.endedAtUs) <= windowUs) {
            break;
        }
        rollingChunks[rollingChunkHead] = RollingChunk{};
        rollingChunkHead = (rollingChunkHead + 1U) % SENSOR_ROLLING_CHUNK_CAPACITY;
        rollingChunkCount--;
    }
}

void pushRollingChunk(float temperatureC, float humidityPct, uint32_t endedAtUs) {
    trimRollingChunks(endedAtUs);
    if (rollingChunkCount >= SENSOR_ROLLING_CHUNK_CAPACITY) {
        rollingChunks[rollingChunkHead] = RollingChunk{};
        rollingChunkHead = (rollingChunkHead + 1U) % SENSOR_ROLLING_CHUNK_CAPACITY;
        rollingChunkCount--;
    }
    const size_t insertIndex = (rollingChunkHead + rollingChunkCount) % SENSOR_ROLLING_CHUNK_CAPACITY;
    rollingChunks[insertIndex].endedAtUs = endedAtUs;
    rollingChunks[insertIndex].temperatureC = temperatureC;
    rollingChunks[insertIndex].humidityPct = humidityPct;
    rollingChunkCount++;
}

void resetCurrentChunk() {
    sensorSampler.chunkTempSum = 0.0f;
    sensorSampler.chunkHumiditySum = 0.0f;
    sensorSampler.chunkSampleCount = 0;
}

void restartSensorSampler(bool clearHistory = false) {
    const uint32_t nowUs = micros();
    sensorSampler.requestInFlight = false;
    sensorSampler.requestIssuedAtUs = 0;
    sensorSampler.nextRequestAtUs = nowUs;
    sensorSampler.chunkStartedAtUs = nowUs;
    sensorSampler.effectiveSamplePeriodUs = requestedSamplePeriodUs();
    sensorSampler.consecutiveGoodSamples = 0;
    sensorSampler.consecutiveBadSamples = 0;
    resetCurrentChunk();
    if (clearHistory) {
        clearBufferedChunks();
        lastTempC = NAN;
        lastHumidity = NAN;
        lastGoodSampleAtUs = 0;
    }
}

void noteSamplingFailure() {
    sensorSampler.consecutiveBadSamples = min<uint8_t>(sensorSampler.consecutiveBadSamples + 1, 32);
    sensorSampler.consecutiveGoodSamples = 0;
    const uint32_t backoffStepUs = SENSOR_ADAPTIVE_BACKOFF_STEP_US *
                                   min<uint8_t>(sensorSampler.consecutiveBadSamples, 4);
    sensorSampler.effectiveSamplePeriodUs = min(
        SENSOR_MAX_SAMPLE_PERIOD_US,
        max(sensorSampler.effectiveSamplePeriodUs, requestedSamplePeriodUs()) + backoffStepUs
    );
}

void noteSamplingSuccess() {
    sensorSampler.consecutiveBadSamples = 0;
    sensorSampler.consecutiveGoodSamples = min<uint8_t>(sensorSampler.consecutiveGoodSamples + 1, 32);
    const uint32_t targetPeriodUs = requestedSamplePeriodUs();
    if (sensorSampler.effectiveSamplePeriodUs > targetPeriodUs &&
        sensorSampler.consecutiveGoodSamples >= SENSOR_ADAPTIVE_RECOVERY_GOOD_SAMPLES) {
        sensorSampler.effectiveSamplePeriodUs = max(
            targetPeriodUs,
            sensorSampler.effectiveSamplePeriodUs - SENSOR_ADAPTIVE_RECOVERY_STEP_US
        );
        sensorSampler.consecutiveGoodSamples = 0;
    }
}

void finalizeCurrentChunk() {
    const uint32_t chunkEndedAtUs = sensorSampler.chunkStartedAtUs + SENSOR_CHUNK_US;
    if (sensorSampler.chunkSampleCount > 0) {
        pushRollingChunk(
            sensorSampler.chunkTempSum / sensorSampler.chunkSampleCount,
            sensorSampler.chunkHumiditySum / sensorSampler.chunkSampleCount,
            chunkEndedAtUs
        );
    } else if (canReuseLastSampleForChunk(chunkEndedAtUs)) {
        pushRollingChunk(lastTempC, lastHumidity, chunkEndedAtUs);
    }
    resetCurrentChunk();
}

void rollChunkWindows(uint32_t nowUs) {
    if (sensorSampler.chunkStartedAtUs == 0) {
        sensorSampler.chunkStartedAtUs = nowUs;
    }

    while (timeReachedUs(nowUs, sensorSampler.chunkStartedAtUs + SENSOR_CHUNK_US)) {
        finalizeCurrentChunk();
        sensorSampler.chunkStartedAtUs += SENSOR_CHUNK_US;
    }
}

void recordSensorSample(float temperatureC, float humidityPct) {
    if (!isValidSensorSample(temperatureC, humidityPct)) {
        return;
    }
    lastTempC = temperatureC;
    lastHumidity = humidityPct;
    lastGoodSampleAtUs = micros();
    sensorSampler.chunkTempSum += temperatureC;
    sensorSampler.chunkHumiditySum += humidityPct;
    sensorSampler.chunkSampleCount++;
}

bool prepareReadingSnapshot(float& temperatureC, float& humidityPct, bool& sensorOk) {
    const uint32_t nowUs = micros();
    rollChunkWindows(nowUs);
    trimRollingChunks(nowUs);

