alexandergrib/ESP32_temp_and_Humidity_monitor/satellite/satellite.ino
    if (rollingChunkCount > 0) {
        float rollingTemperatureSum = 0.0f;
        float rollingHumiditySum = 0.0f;
        size_t rollingCount = 0;
        for (size_t i = 0; i < rollingChunkCount; ++i) {
            const RollingChunk& chunk = rollingChunks[(rollingChunkHead + i) % SENSOR_ROLLING_CHUNK_CAPACITY];
            if (!isValidSensorSample(chunk.temperatureC, chunk.humidityPct)) {
                continue;
            }
            rollingTemperatureSum += chunk.temperatureC;
            rollingHumiditySum += chunk.humidityPct;
            rollingCount++;
        }
        if (rollingCount > 0) {
            const float rollingTemperatureC = rollingTemperatureSum / rollingCount;
            const float rollingHumidityPct = rollingHumiditySum / rollingCount;
            if (isValidSensorSample(rollingTemperatureC, rollingHumidityPct)) {
                temperatureC = rollingTemperatureC;
                humidityPct = rollingHumidityPct;
                sensorOk = true;
                return true;
            }
        }
    }

    if (hasRecentGoodSample(nowUs)) {
        temperatureC = lastTempC;
        humidityPct = lastHumidity;
        sensorOk = true;
        return true;
    }

    temperatureC = NAN;
    humidityPct = NAN;
    sensorOk = false;
    return false;
}

BufferedReading* oldestBufferedReading() {
    if (readingBufferCount == 0) {
        return nullptr;
    }
    return &readingBuffer[readingBufferHead];
}

void dropOldestBufferedReading() {
    if (readingBufferCount == 0) {
        return;
    }
    readingBuffer[readingBufferHead] = BufferedReading{};
    readingBufferHead = (readingBufferHead + 1U) % READING_BUFFER_CAPACITY;
    readingBufferCount--;
}

bool enqueueBufferedReading(float temperatureC, float humidityPct, bool sensorOk) {
    if (readingBufferCount >= READING_BUFFER_CAPACITY) {
        return false;
    }
    const size_t insertIndex = (readingBufferHead + readingBufferCount) % READING_BUFFER_CAPACITY;
    BufferedReading& item = readingBuffer[insertIndex];
    item = BufferedReading{};
    item.used = true;
    item.sequence = txSeq++;
    item.sampledAtMs = millis();
    item.temperatureC = temperatureC;
    item.humidityPct = humidityPct;
    item.sensorOk = sensorOk ? 1 : 0;
    readingBufferCount++;
    return true;
}

void scheduleNextReport(uint32_t delayMs) {
    nextReportDueAtMs = millis() + max<uint32_t>(delayMs, 25);
}

void captureScheduledReading() {
    float temperatureC = NAN;
    float humidityPct = NAN;
    bool sensorOk = false;
    prepareReadingSnapshot(temperatureC, humidityPct, sensorOk);
    if (!enqueueBufferedReading(temperatureC, humidityPct, sensorOk)) {
        Serial.println("Reading buffer full, keeping oldest unsent data");
    }
}

void markSampleRequestScheduled(uint32_t nowUs) {
    if (sensorSampler.nextRequestAtUs == 0) {
        sensorSampler.nextRequestAtUs = nowUs;
    }
    while (timeReachedUs(nowUs, sensorSampler.nextRequestAtUs)) {
        sensorSampler.nextRequestAtUs += samplePeriodUs();
    }
}

uint32_t crc32Update(uint32_t crc, const uint8_t* data, size_t len) {
    uint32_t value = crc;
    for (size_t i = 0; i < len; ++i) {
        value ^= data[i];
        for (uint8_t bit = 0; bit < 8; ++bit) {
            if ((value & 1U) != 0U) {
                value = (value >> 1U) ^ 0xEDB88320U;
            } else {
                value >>= 1U;
            }
        }
    }
    return value;
}

void resetOtaState() {
    otaState = SatelliteOtaState{};
}

void saveConfig() {
    prefs.begin("tmon-node", false);
    prefs.putBool("bound", isBound);
    prefs.putUInt("nodeId", nodeId);
    prefs.putUInt("reportMs", normalizeReportInterval(reportIntervalMs));
    prefs.putUShort("sampleHz", normalizeSampleRateHz(sampleRateHz));
    prefs.putFloat("tempOff", tempOffsetC);
    prefs.putBool("heaterOn", heaterEnabled);
    prefs.putBool("sleepEn", sleepEnabled);
    prefs.putBytes("ctrlMac", controllerMac, 6);
    prefs.putString("name", String(nodeName));
    prefs.end();
}

void loadConfig() {
    prefs.begin("tmon-node", false);
    isBound = prefs.getBool("bound", false);
    nodeId = prefs.getUInt("nodeId", 0);
    reportIntervalMs = normalizeReportInterval(prefs.getUInt("reportMs", DEFAULT_REPORT_MS));
    sampleRateHz = normalizeSampleRateHz(prefs.getUShort("sampleHz", DEFAULT_SAMPLE_RATE_HZ));
    tempOffsetC = prefs.getFloat("tempOff", 0.0f);
    heaterEnabled = prefs.getBool("heaterOn", false);
    sleepEnabled = prefs.getBool("sleepEn", false);
    prefs.getBytes("ctrlMac", controllerMac, 6);
    String name = prefs.getString("name", DEFAULT_NODE_NAME);
    sanitizeNodeName(name).toCharArray(nodeName, sizeof(nodeName));
    prefs.end();
    if (macIsZero(controllerMac)) isBound = false;
}

bool ensurePeer(const uint8_t* mac) {
    if (esp_now_is_peer_exist(mac)) return true;
    esp_now_peer_info_t peer{};
    memcpy(peer.peer_addr, mac, 6);
    peer.channel = RADIO_CHANNEL;
    peer.encrypt = false;
    return esp_now_add_peer(&peer) == ESP_OK;
}

bool initEspNowRadio() {
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    esp_wifi_set_ps(WIFI_PS_NONE);
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(RADIO_CHANNEL, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);

    if (esp_now_init() != ESP_OK) {
        return false;
    }

    esp_now_register_recv_cb(onDataRecv);
    esp_now_register_send_cb(onDataSent);
    return true;
}

bool resetEspNowRadioAfterWake() {
    esp_now_deinit();
    WiFi.mode(WIFI_OFF);
    delay(2);

    if (!initEspNowRadio()) {
        Serial.println("ESP-NOW reinit failed after wake");
        return false;
    }

    if (isBound) {
        ensurePeer(controllerMac);
    }
    return true;
}

bool initSensor() {
    Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
    Wire.setClock(SENSOR_I2C_CLOCK_HZ);
    if (!sht.begin()) return false;
    sht.clearStatus();
    applySensorConfig();
    restartSensorSampler(true);
    return true;
}

void pumpSensorSampling() {
    const uint32_t nowUs = micros();
    rollChunkWindows(nowUs);

    if (otaState.active) return;

    if (sensorSampler.requestInFlight) {
        if (timeReachedUs(nowUs, sensorSampler.requestIssuedAtUs + SENSOR_MIN_SETTLE_US) && sht.dataReady(true)) {
            sensorPresent = sht.readData(false);
            if (sensorPresent) {
                const float temperatureC = sht.getTemperature();
                const float humidityPct = sht.getHumidity();
                if (isValidSensorSample(temperatureC, humidityPct)) {
                    recordSensorSample(temperatureC, humidityPct);
                    noteSamplingSuccess();
                } else {
                    sensorPresent = false;
                    noteSamplingFailure();
                }
            } else {
                noteSamplingFailure();
            }
            sensorSampler.requestInFlight = false;
            markSampleRequestScheduled(nowUs);
        } else if (timeReachedUs(nowUs, sensorSampler.requestIssuedAtUs + SENSOR_REQUEST_TIMEOUT_US)) {
            sensorPresent = false;
            sensorSampler.requestInFlight = false;
            noteSamplingFailure();
            sensorSampler.nextRequestAtUs = nowUs + SENSOR_RETRY_INTERVAL_US;
        }
        return;
    }

    if (!timeReachedUs(nowUs, sensorSampler.nextRequestAtUs)) return;

    if (sht.requestData(true)) {
        sensorSampler.requestInFlight = true;
        sensorSampler.requestIssuedAtUs = nowUs;
    } else {
        sensorPresent = false;
        noteSamplingFailure();
        sensorSampler.nextRequestAtUs = nowUs + SENSOR_RETRY_INTERVAL_US;
    }
}

void sendBindRequest() {
    uint8_t broadcastMac[] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
    ensurePeer(broadcastMac);

    BindRequest msg{};
    fillHeader(msg.header, MSG_BIND_REQUEST, txSeq++, nodeId, millis());
    strncpy(msg.nodeName, nodeName, sizeof(msg.nodeName) - 1);
    msg.fwMajor = FW_VERSION_MAJOR;
    msg.fwMinor = FW_VERSION_MINOR;
    msg.capabilities = 0x0001;
    esp_now_send(broadcastMac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
    noteActivity();
}

bool sendReading() {
    if (!isBound) return false;
    BufferedReading* pending = oldestBufferedReading();
    if (pending == nullptr) {
        return false;
    }

    Reading msg{};
    fillHeader(msg.header, MSG_READING, pending->sequence, nodeId, millis());
    msg.temperatureC = pending->temperatureC;
    msg.humidityPct = pending->humidityPct;
    msg.vbat = NAN;
    msg.sensorOk = pending->sensorOk;
    msg.rssiHint = 0;
    msg.reserved[0] = FW_VERSION_MAJOR;
    msg.reserved[1] = FW_VERSION_MINOR;
    ensurePeer(controllerMac);
    esp_now_send(controllerMac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
    pending->lastSendAtMs = millis();
    pending->retryCount = min<uint8_t>(pending->retryCount + 1, 255);
    noteActivity();
    stayAwakeForController();
    return true;
}

void sendConfigAck(bool applied) {
    if (!isBound) return;
    ConfigAck msg{};
    fillHeader(msg.header, MSG_CONFIG_ACK, txSeq++, nodeId, millis());
    msg.reportIntervalMs = reportIntervalMs;
    msg.nextReportDelayMs = nextReportDueAtMs > millis() ? nextReportDueAtMs - millis() : 0;
    msg.tempOffsetC = tempOffsetC;
    msg.applied = applied ? 1 : 0;
    msg.heaterEnabled = heaterEnabled ? 1 : 0;
    msg.otaReady = otaReady ? 1 : 0;
    msg.sleepEnabled = sleepEnabled ? 1 : 0;
    msg.sampleRateHz = normalizeSampleRateHz(sampleRateHz);
    ensurePeer(controllerMac);
    esp_now_send(controllerMac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
    noteActivity();
}

