alexandergrib/ESP32_temp_and_Humidity_monitor/satellite/satellite.ino
void sendRenameAck(bool applied) {
    if (!isBound) return;
    RenameAck msg{};
    fillHeader(msg.header, MSG_RENAME_ACK, txSeq++, nodeId, millis());
    msg.applied = applied ? 1 : 0;
    strncpy(msg.nodeName, nodeName, sizeof(msg.nodeName) - 1);
    ensurePeer(controllerMac);
    esp_now_send(controllerMac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
    noteActivity();
}

void handleReadingAck(const ReadingAck& ack) {
    BufferedReading* pending = oldestBufferedReading();
    if (pending == nullptr) {
        return;
    }
    if (!ack.accepted || ack.readingSequence != pending->sequence) {
        return;
    }
    dropOldestBufferedReading();
    stayAwakeForController();
}

void sendOtaAck(OtaPhase phase, OtaStatus status, uint32_t bytesReceived, uint16_t detail = 0) {
    if (!isBound) return;
    OtaAck msg{};
    fillHeader(msg.header, MSG_OTA_ACK, txSeq++, nodeId, millis());
    msg.phase = phase;
    msg.status = status;
    msg.detail = detail;
    msg.bytesReceived = bytesReceived;
    ensurePeer(controllerMac);
    esp_now_send(controllerMac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
    noteActivity();
}

void handleOtaBegin(const OtaBegin& msg) {
    if (!otaReady) {
        sendOtaAck(OTA_PHASE_BEGIN, OTA_STATUS_NOT_READY, otaState.bytesWritten);
        return;
    }

    if (otaState.active) {
        sendOtaAck(OTA_PHASE_BEGIN, OTA_STATUS_BUSY, otaState.bytesWritten);
        return;
    }

    if (!Update.begin(msg.totalSize, U_FLASH)) {
        sendOtaAck(OTA_PHASE_BEGIN, OTA_STATUS_REJECTED, 0, static_cast<uint16_t>(Update.getError()));
        return;
    }

    resetOtaState();
    otaState.active = true;
    otaState.totalSize = msg.totalSize;
    otaState.expectedCrc32 = msg.expectedCrc32;
    otaState.runningCrc32 = 0xFFFFFFFF;
    sendOtaAck(OTA_PHASE_BEGIN, OTA_STATUS_OK, 0);
}

void handleOtaChunk(const OtaChunk& msg) {
    if (!otaState.active) {
        sendOtaAck(OTA_PHASE_CHUNK, OTA_STATUS_NOT_ACTIVE, otaState.bytesWritten);
        return;
    }

    if (msg.dataLen == 0 || msg.dataLen > OTA_CHUNK_BYTES) {
        sendOtaAck(OTA_PHASE_CHUNK, OTA_STATUS_WRITE_FAILED, otaState.bytesWritten, 0);
        return;
    }

    const bool isDuplicate =
        otaState.bytesWritten == (otaState.lastChunkOffset + otaState.lastChunkLen) &&
        msg.offset == otaState.lastChunkOffset &&
        msg.dataLen == otaState.lastChunkLen;

    if (isDuplicate) {
        sendOtaAck(OTA_PHASE_CHUNK, OTA_STATUS_OK, otaState.bytesWritten);
        return;
    }

    if (msg.offset != otaState.bytesWritten) {
        sendOtaAck(OTA_PHASE_CHUNK, OTA_STATUS_OFFSET_MISMATCH, otaState.bytesWritten);
        return;
    }

    const size_t written = Update.write(const_cast<uint8_t*>(msg.data), msg.dataLen);
    if (written != msg.dataLen) {
        sendOtaAck(OTA_PHASE_CHUNK, OTA_STATUS_WRITE_FAILED, otaState.bytesWritten, static_cast<uint16_t>(Update.getError()));
        return;
    }

    otaState.runningCrc32 = crc32Update(otaState.runningCrc32, msg.data, msg.dataLen);
    otaState.lastChunkOffset = msg.offset;
    otaState.lastChunkLen = msg.dataLen;
    otaState.bytesWritten += msg.dataLen;
    sendOtaAck(OTA_PHASE_CHUNK, OTA_STATUS_OK, otaState.bytesWritten);
}

void handleOtaEnd(const OtaEnd& msg) {
    if (!otaState.active) {
        sendOtaAck(OTA_PHASE_END, OTA_STATUS_NOT_ACTIVE, otaState.bytesWritten);
        return;
    }

    if (msg.totalSize != otaState.totalSize || otaState.bytesWritten != otaState.totalSize) {
        sendOtaAck(OTA_PHASE_END, OTA_STATUS_OFFSET_MISMATCH, otaState.bytesWritten);
        return;
    }

    const uint32_t finalCrc32 = otaState.runningCrc32 ^ 0xFFFFFFFFU;
    if (finalCrc32 != otaState.expectedCrc32 || msg.expectedCrc32 != otaState.expectedCrc32) {
        Update.abort();
        sendOtaAck(OTA_PHASE_END, OTA_STATUS_CRC_MISMATCH, otaState.bytesWritten);
        resetOtaState();
        return;
    }

    if (!Update.end(true)) {
        sendOtaAck(OTA_PHASE_END, OTA_STATUS_END_FAILED, otaState.bytesWritten, static_cast<uint16_t>(Update.getError()));
        resetOtaState();
        return;
    }

    sendOtaAck(OTA_PHASE_END, OTA_STATUS_OK, otaState.bytesWritten);
    resetOtaState();
    otaRebootPending = true;
    otaRebootAtMs = millis() + 750;
}

void handleIncomingPacket(const uint8_t* data, int len) {
    if (len < static_cast<int>(sizeof(Header))) return;
    const Header* h = reinterpret_cast<const Header*>(data);
    if (!validHeader(*h)) return;
    lastControllerContactAtMs = millis();
    stayAwakeForController();

    if (h->type == MSG_BIND_ACK && len == sizeof(BindAck)) {
        const BindAck* ack = reinterpret_cast<const BindAck*>(data);
        if (!ack->accepted) return;
        memcpy(controllerMac, ack->controllerMac, 6);
        nodeId = ack->assignedNodeId;
        reportIntervalMs = normalizeReportInterval(ack->reportIntervalMs);
        sampleRateHz = normalizeSampleRateHz(ack->sampleRateHz);
        tempOffsetC = ack->tempOffsetC;
        heaterEnabled = ack->heaterEnabled != 0;
        otaReady = ack->otaReady != 0;
        sleepEnabled = ack->sleepEnabled != 0;
        applySensorConfig();
        restartSensorSampler(true);
        isBound = true;
        ensurePeer(controllerMac);
        scheduleNextReport(ack->nextReportDelayMs);
        lastControllerContactAtMs = millis();
        lastRecoveryBindAttemptAtMs = 0;
        saveConfig();
        Serial.printf(
            "Bound to controller %s as node %lu fw %u.%u heater %s sample %uHz\n",
            macToString(controllerMac).c_str(),
            static_cast<unsigned long>(nodeId),
            FW_VERSION_MAJOR,
            FW_VERSION_MINOR,
            heaterEnabled ? "on" : "off",
            static_cast<unsigned>(sampleRateHz)
        );
        noteActivity();
    } else if (h->type == MSG_CONFIG_SET && len == sizeof(ConfigSet)) {
        const ConfigSet* cfg = reinterpret_cast<const ConfigSet*>(data);
        reportIntervalMs = normalizeReportInterval(cfg->reportIntervalMs);
        sampleRateHz = normalizeSampleRateHz(cfg->sampleRateHz);
        tempOffsetC = cfg->tempOffsetC;
        heaterEnabled = cfg->heaterEnabled != 0;
        otaReady = cfg->otaReady != 0;
        sleepEnabled = cfg->sleepEnabled != 0;
        applySensorConfig();
        restartSensorSampler(true);
        scheduleNextReport(cfg->nextReportDelayMs);
        lastControllerContactAtMs = millis();
        lastRecoveryBindAttemptAtMs = 0;
        saveConfig();
        sendConfigAck(true);
        noteActivity();
    } else if (h->type == MSG_READING_ACK && len == sizeof(ReadingAck) && isBound) {
        handleReadingAck(*reinterpret_cast<const ReadingAck*>(data));
        noteActivity();
    } else if (h->type == MSG_RENAME_SET && len == sizeof(RenameSet) && isBound) {
        const RenameSet* rename = reinterpret_cast<const RenameSet*>(data);
        sanitizeNodeName(String(rename->nodeName)).toCharArray(nodeName, sizeof(nodeName));
        saveConfig();
        sendRenameAck(true);
        noteActivity();
    } else if (h->type == MSG_OTA_BEGIN && len == sizeof(OtaBegin) && isBound) {
        handleOtaBegin(*reinterpret_cast<const OtaBegin*>(data));
        noteActivity();
    } else if (h->type == MSG_OTA_CHUNK && len == sizeof(OtaChunk) && isBound) {
        handleOtaChunk(*reinterpret_cast<const OtaChunk*>(data));
        noteActivity();
    } else if (h->type == MSG_OTA_END && len == sizeof(OtaEnd) && isBound) {
        handleOtaEnd(*reinterpret_cast<const OtaEnd*>(data));
        noteActivity();
    }
}

