alexandergrib/ESP32_temp_and_Humidity_monitor/satellite/satellite.ino
void maintainControllerLink() {
    if (!isBound || otaState.active || otaReady) {
        return;
    }

    const uint32_t nowMs = millis();
    const uint32_t staleAfterMs = max<uint32_t>(15000, normalizeReportInterval(reportIntervalMs) * 3U);
    if (!timeReachedMs(nowMs, lastControllerContactAtMs + staleAfterMs)) {
        return;
    }

    stayAwakeForController();
    if (!timeReachedMs(nowMs, lastRecoveryBindAttemptAtMs + 3000)) {
        return;
    }

    lastRecoveryBindAttemptAtMs = nowMs;
    sendBindRequest();
    Serial.println("Controller contact stale, rebinding...");
}

void logSendStatus(esp_now_send_status_t status) {
    if (status != ESP_NOW_SEND_SUCCESS) {
        Serial.println("Last send: fail");
    }
}

void queueScheduledReadingsIfDue() {
    if (!isBound || otaState.active) {
        return;
    }
    uint32_t nowMs = millis();
    while (timeReachedMs(nowMs, nextReportDueAtMs)) {
        captureScheduledReading();
        nextReportDueAtMs += normalizeReportInterval(reportIntervalMs);
        nowMs = millis();
        if (readingBufferCount >= READING_BUFFER_CAPACITY) {
            break;
        }
    }
}

void serviceReadingDelivery() {
    if (!isBound || otaState.active) {
        return;
    }
    BufferedReading* pending = oldestBufferedReading();
    if (pending == nullptr) {
        return;
    }

    const uint32_t nowMs = millis();
    if (pending->lastSendAtMs == 0) {
        sendReading();
        return;
    }

    uint32_t nextRetryAtMs = pending->lastSendAtMs + READING_ACK_TIMEOUT_MS;
    if (pending->retryCount >= READING_MAX_RETRIES) {
        nextRetryAtMs = pending->lastSendAtMs + max<uint32_t>(normalizeReportInterval(reportIntervalMs), READING_ACK_TIMEOUT_MS);
        if (timeReachedMs(nowMs, nextRetryAtMs)) {
            pending->retryCount = 0;
        }
    } else {
        nextRetryAtMs += READING_RETRY_BACKOFF_MS;
    }

    if (timeReachedMs(nowMs, nextRetryAtMs)) {
        sendReading();
    }
}

void lightSleepForMs(uint32_t sleepMs) {
    if (sleepMs < 20) {
        return;
    }
    esp_sleep_enable_timer_wakeup(static_cast<uint64_t>(sleepMs) * 1000ULL);
    esp_light_sleep_start();
    esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_TIMER);
    resetEspNowRadioAfterWake();
    stayAwakeForController(200);
}

void maybeSleep() {
    if (DEBUG_FORCE_NO_SLEEP || !sleepEnabled) {
        return;
    }

    if (otaState.active || otaRebootPending || otaReady) {
        return;
    }

    const uint32_t nowMs = millis();
    if (!timeReachedMs(nowMs, controllerAwakeUntilMs)) {
        return;
    }

    if (!isBound) {
        lightSleepForMs(UNBOUND_SLEEP_MS);
        return;
    }

    uint32_t nextWakeAtMs = nextReportDueAtMs;
    if (BufferedReading* pending = oldestBufferedReading()) {
        uint32_t retryAtMs = pending->lastSendAtMs == 0
            ? nowMs
            : pending->lastSendAtMs + READING_ACK_TIMEOUT_MS + READING_RETRY_BACKOFF_MS;
        if (pending->retryCount >= READING_MAX_RETRIES) {
            retryAtMs = pending->lastSendAtMs + max<uint32_t>(normalizeReportInterval(reportIntervalMs), READING_ACK_TIMEOUT_MS);
        }
        if (timeReachedMs(nextWakeAtMs, retryAtMs)) {
            nextWakeAtMs = retryAtMs;
        }
    }

    if (timeReachedMs(nowMs + 20, nextWakeAtMs)) {
        return;
    }
    lightSleepForMs(nextWakeAtMs - nowMs);
}

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void onDataRecv(const esp_now_recv_info_t*, const uint8_t* data, int len) {
    handleIncomingPacket(data, len);
}

void onDataSent(const wifi_tx_info_t*, esp_now_send_status_t status) {
    logSendStatus(status);
}
#else
void onDataRecv(const uint8_t*, const uint8_t* data, int len) {
    handleIncomingPacket(data, len);
}

void onDataSent(const uint8_t*, esp_now_send_status_t status) {
    logSendStatus(status);
}
#endif

void setup() {
    const bool cpuFreqApplied = setCpuFrequencyMhz(SATELLITE_CPU_FREQ_MHZ);
    Serial.begin(SERIAL_BAUD);
    delay(500);
    loadConfig();
    Serial.printf(
        "Satellite CPU frequency: %u MHz%s\n",
        static_cast<unsigned>(getCpuFrequencyMhz()),
        cpuFreqApplied ? "" : " (requested change failed)"
    );
    if (DEBUG_FORCE_NO_SLEEP) {
        Serial.println("DEBUG_FORCE_NO_SLEEP enabled: light sleep disabled");
    } else {
        Serial.printf(
            "Sleep mode: %s\n",
            sleepEnabled ? "enabled" : "disabled"
        );
    }
    initStatusLed();
    sensorPresent = initSensor();

    if (!initEspNowRadio()) {
        Serial.println("ESP-NOW init failed");
        return;
    }

    if (isBound) {
        ensurePeer(controllerMac);
        scheduleNextReport(reportIntervalMs);
        stayAwakeForController();
        lastControllerContactAtMs = millis();
        lastRecoveryBindAttemptAtMs = 0;
        Serial.printf(
            "Loaded binding: node %lu controller %s fw %u.%u\n",
            static_cast<unsigned long>(nodeId),
            macToString(controllerMac).c_str(),
            FW_VERSION_MAJOR,
            FW_VERSION_MINOR
        );
        sendBindRequest();
        Serial.println("Rebinding with controller...");
    } else {
        Serial.println("Unbound. Waiting to pair with controller...");
    }
}

void loop() {
    updateStatusLed();

    if (otaRebootPending && static_cast<int32_t>(millis() - otaRebootAtMs) >= 0) {
        ESP.restart();
    }

    pumpSensorSampling();

    if (!isBound) {
        static uint32_t lastBindAttemptAt = 0;
        if (millis() - lastBindAttemptAt >= 3000) {
            lastBindAttemptAt = millis();
            sendBindRequest();
            Serial.println("Bind request sent");
        }
        maybeSleep();
        delay(1);
        return;
    }

    maintainControllerLink();
    queueScheduledReadingsIfDue();
    serviceReadingDelivery();
    maybeSleep();
    delay(1);
}
